
#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-ADD
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-ADD.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	// описание шагов
	// пример вызова Ванесса.ДобавитьШагВМассивТестов(ВсеТесты, Снипет, ИмяПроцедуры, ПредставлениеТеста, ОписаниеШага, ТипШагаДляОписания, ТипШагаВДереве);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСправочникеПоявляетсяЭлемент(Парам01,Парам02)","ВСправочникеПоявляетсяЭлемент","Тогда в справочнике ""Причины отказа в займе"" появляется элемент ""Запрет по линии ФМС""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ВСправочникеПоявляетсяЭлементСНаименованием(Парам01,Парам02)","ВСправочникеПоявляетсяЭлементСНаименованием","Тогда в справочнике ""ПричиныОтказаВЗайме"" появляется элемент с наименованием ""Запрет по линии ФМС""","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯУдаляюЗагруженныеДанные(Парам01)","ЯУдаляюЗагруженныеДанные","И я удаляю загруженные данные ""ДанныеИзМакета""","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////


&НаКлиенте
//Тогда в справочнике "ПричиныОтказаВЗайме" появляется элемент с наименованием "Запрет по линии ФМС"
//@ВСправочникеПоявляетсяЭлементСНаименованием(Парам01,Парам02)
Процедура ВСправочникеПоявляетсяЭлементСНаименованием(ИмяСправочника, НаименованиеЭлемента) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВСправочникеПоявляетсяЭлементСНаименованиемНаСервере(ИмяСправочника, НаименованиеЭлемента);
КонецПроцедуры

&НаСервере
Процедура ВСправочникеПоявляетсяЭлементСНаименованиемНаСервере(ИмяСправочника, НаименованиеЭлемента)
	
	Если Справочники[ИмяСправочника].НайтиПоНаименованию(НаименованиеЭлемента, Истина) = Неопределено Тогда
		ВызватьИсключение "Элемент не создан!";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//И я удаляю загруженные данные "ДанныеИзМакета"
//@ЯУдаляюЗагруженныеДанные(Парам01)
Процедура ЯУдаляюЗагруженныеДанные(ДанныеИзМакета) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ГенераторДанных = Ванесса.Плагин("СериализаторMXL");
	Если ГенераторДанных.УдалитьСозданныеДанные(Контекст.ДанныеИзМакета) <> 1 Тогда
		ВызватьИсключение "Данные не удалены!";
	КонецЕсли; 
КонецПроцедуры
